#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gh-repository-terraform01.github_repository.github_repo_terraform01 will be created
  + resource "github_repository" "github_repo_terraform01" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Terraform Repository Managed"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform01"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
    }

  # module.gh-repository-terraform01.github_repository_environment.git_environments["development"] will be created
  + resource "github_repository_environment" "git_environments" {
      + environment = "development"
      + id          = (known after apply)
      + repository  = "terraform01"

      + deployment_branch_policy {
          + custom_branch_policies = true
          + protected_branches     = false
        }
    }

  # module.gh-repository-terraform01.github_repository_environment.git_environments["production"] will be created
  + resource "github_repository_environment" "git_environments" {
      + environment = "production"
      + id          = (known after apply)
      + repository  = "terraform01"

      + deployment_branch_policy {
          + custom_branch_policies = false
          + protected_branches     = true
        }
    }

  # module.gh-repository-terraform01.github_repository_environment.git_environments["stage"] will be created
  + resource "github_repository_environment" "git_environments" {
      + environment = "stage"
      + id          = (known after apply)
      + repository  = "terraform01"

      + deployment_branch_policy {
          + custom_branch_policies = true
          + protected_branches     = false
        }
    }

  # module.gh-repository-terraform01.github_repository_file.github_repository_file_readme will be created
  + resource "github_repository_file" "github_repository_file_readme" {
      + branch              = "main"
      + commit_author       = "terraform"
      + commit_email        = "luiz.terraform@xpto.com"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Ansible Repository - Managed By Terraform
             Here we can manage our repository files
             ```bash
             $terraform --help
             ```
            ![repo-image](https://i.imgur.com/XTcaAY6.png)
             If we want to delete the Development Branch
            ```bash
             $terraform destroy --target github_branch.github_branch_development
            ```
            If we want to apply the change in one resource
            ```bash
             $terraform apply --target github_repository_file.github_repository_file_readme
            ```
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "terraform01"
      + sha                 = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @isweluiz, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Syntax Check`*